# Pandas DataFrame:-

A dataframe is 2D data structure and is aligned in tabular fashion in rows and columns

syntax:

pamdas.DataFrame(data,index,columns,dtype)

A pandas dataframe can be created by using:-
1) List
2) Dictionary
3) Series
4) Numpy ndarrays
5) Another DataFrame

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Creation Of DataFrame using list & List of List

In [5]:
data=[10,20,30,40,50,60]
data

[10, 20, 30, 40, 50, 60]

In [6]:
df=pd.DataFrame(data)
df

    0
0  10
1  20
2  30
3  40
4  50
5  60

In [7]:
df.shape

(6, 1)

6 rows 1 colmn

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.dtypes

0    int64
dtype: object

In [11]:
data=[['Aman',23],['Deepak',28],['Pamkaj',25],['Saroj',30]]
data

[['Aman', 23], ['Deepak', 28], ['Pamkaj', 25], ['Saroj', 30]]

In [12]:
type(data)

list

In [13]:
df=pd.DataFrame(data)
df

        0   1
0    Aman  23
1  Deepak  28
2  Pamkaj  25
3   Saroj  30

In [14]:
df.dtypes

0    object
1     int64
dtype: object

In [15]:
df=pd.DataFrame(data,index=['Stu1','Stu2','Stu3','Stu4'],columns=['Name','Age'])
df

        Name  Age
Stu1    Aman   23
Stu2  Deepak   28
Stu3  Pamkaj   25
Stu4   Saroj   30

In [16]:
dic={'Name':str,'Age':float}

In [17]:
df=df.astype(dic)
df

        Name   Age
Stu1    Aman  23.0
Stu2  Deepak  28.0
Stu3  Pamkaj  25.0
Stu4   Saroj  30.0

for diff data types in colmns if u want to change data type of age use astype

In [19]:
df.dtypes

Name     object
Age     float64
dtype: object

# How To Convert DataFrame To Series, Numpy Array , List & Dictionary:-

In [21]:
df=pd.DataFrame([2,6,8,9,1],columns=['Col_1'])
df

   Col_1
0      2
1      6
2      8
3      9
4      1

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
s1=df['Col_1']# to convert df to series
s1

0    2
1    6
2    8
3    9
4    1
Name: Col_1, dtype: int64

In [24]:
type(s1)

pandas.core.series.Series

In [25]:
# Numpy Array Conversion
arr=df.Col_1.values
arr

array([2, 6, 8, 9, 1], dtype=int64)

In [26]:
type(arr)

numpy.ndarray

In [27]:
# List Conversion
li=df.Col_1.tolist()
li

[2, 6, 8, 9, 1]

In [28]:
type(li)

list

In [29]:
# Dictionary Conversion
dic=pd.DataFrame.to_dict(df)
dic

{'Col_1': {0: 2, 1: 6, 2: 8, 3: 9, 4: 1}}

In [30]:
type(dic)

dict

# DataFrame Creation Using Series

In [32]:
s1=pd.Series([2,4,5,6,7,8],index=list('abcdef'))

In [33]:
s1

a    2
b    4
c    5
d    6
e    7
f    8
dtype: int64

In [34]:
type(s1)

pandas.core.series.Series

In [35]:
df=pd.DataFrame(s1)
df

   0
a  2
b  4
c  5
d  6
e  7
f  8

In [36]:
df.shape

(6, 1)

# DataFrame Creation Using Numpy Array:-

In [38]:
arr=np.array([[2,3],[4,5],[6,7],[8,9]],dtype=np.float64)
arr

array([[2., 3.],
       [4., 5.],
       [6., 7.],
       [8., 9.]])

In [39]:
type(arr)

numpy.ndarray

In [40]:
arr.dtype

dtype('float64')

In [41]:
df=pd.DataFrame(arr,dtype='int')

In [42]:
df

   0  1
0  2  3
1  4  5
2  6  7
3  8  9

# DataFrame Creation Using Dictionary:-

In [44]:
dic={'Name':['Aman','Deepak','Pankaj'],'Age':[23,25,26]}
dic

{'Name': ['Aman', 'Deepak', 'Pankaj'], 'Age': [23, 25, 26]}

In [45]:
type(dic)

dict

In [46]:
df=pd.DataFrame(dic)
df

     Name  Age
0    Aman   23
1  Deepak   25
2  Pankaj   26

In [47]:
df.shape

(3, 2)

# How To Add new Column:-

In [49]:
df['Marks']=[78,67,43]
df

     Name  Age  Marks
0    Aman   23     78
1  Deepak   25     67
2  Pankaj   26     43

In [50]:
df.sort_index(axis=1) # colmn wise sort in asc order and bydefaukt asc=True

   Age  Marks    Name
0   23     78    Aman
1   25     67  Deepak
2   26     43  Pankaj

In [51]:
df.sort_index(axis=1,ascending=False) # colmn wise sort in desc order

     Name  Marks  Age
0    Aman     78   23
1  Deepak     67   25
2  Pankaj     43   26

In [52]:
df

     Name  Age  Marks
0    Aman   23     78
1  Deepak   25     67
2  Pankaj   26     43

In [53]:
df.sort_index(axis=0,ascending=False) 
df

     Name  Age  Marks
0    Aman   23     78
1  Deepak   25     67
2  Pankaj   26     43

Change is Temporary

In [55]:
#df.sort_index(axis=1,ascending=False,inplace=True) 
#df

Now Change is Permanent

In [57]:
df.Age.sort_values(ascending=False)

2    26
1    25
0    23
Name: Age, dtype: int64

In [58]:
df.sort_values(by='Age',ascending=False)
df

     Name  Age  Marks
0    Aman   23     78
1  Deepak   25     67
2  Pankaj   26     43

In [59]:
df.insert(1,'Location',['Noida','Delhi','Gurgaon'])# insert method only used for inserting colmn
df

     Name Location  Age  Marks
0    Aman    Noida   23     78
1  Deepak    Delhi   25     67
2  Pankaj  Gurgaon   26     43

In [109]:
df.drop('Name',axis=1)#to del colmn
df

     Name Location  Age  Marks
0    Aman    Noida   23     78
1  Deepak    Delhi   25     67
2  Pankaj  Gurgaon   26     43

bydefault takes axis=0 for row & to del permanent use inplace=True

In [112]:
df.drop(['Name','Marks'],axis=1)

  Location  Age
0    Noida   23
1    Delhi   25
2  Gurgaon   26

In [115]:
df.drop(1)

     Name Location  Age  Marks
0    Aman    Noida   23     78
2  Pankaj  Gurgaon   26     43

In [117]:
df.drop([0,2])

     Name Location  Age  Marks
1  Deepak    Delhi   25     67

In [119]:
df

     Name Location  Age  Marks
0    Aman    Noida   23     78
1  Deepak    Delhi   25     67
2  Pankaj  Gurgaon   26     43

temp change

In [134]:
df.rename(columns={'City':'Location','Name':'Person'})
df

   Person Location  Age  Marks
0    Aman    Noida   23     78
1  Deepak    Delhi   25     67
2  Pankaj  Gurgaon   26     43

In [136]:
# To add new Row
df.loc[3]=['Jaipur','saroj',20,20]
df

   Person Location  Age  Marks
0    Aman    Noida   23     78
1  Deepak    Delhi   25     67
2  Pankaj  Gurgaon   26     43
3  Jaipur    saroj   20     20

# Indexing In DataFrame

# .iloc[] :-integer location(works only in positional indexing)

# .loc[] :-Location (works only in labelled indexing)

In [140]:
d1=[1,2,3,4]
d2=[5,6,7,8]
d3=[9,3,6,1]
# to append these list in df

In [158]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [160]:
for i in (d1,d2,d3):
    df=df._append([i],ignore_index=True)

In [162]:
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  9  3  6  1